---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ElementsBelongToOtherCircuit
source: html/f6dcfbeb-8567-9284-3725-f06c7a2295ab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ElementsBelongToOtherCircuit Property

You have selected elements that are already part of other Circuits that have assigned Panels. The elements you selected cannot be added to this Circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsBelongToOtherCircuit { get; }
```